In [6]:
import pandas as pd
import numpy as np

In [2]:
from openpyxl.workbook import Workbook

In [13]:
df = pd.read_excel(r"C:\Users\v-trugan\OneDrive - Microsoft\Desktop\TruptiFolder2020\Ex_Files_Python_Data_Visualization\Exercise_Files\3 Pandas\data\car_financing.xlsx")

In [14]:
print(df.head)

<bound method NDFrame.head of      Month  Starting Balance  Repayment  Interest Paid  Principal Paid  \
0        1          34689.96     687.23         202.93          484.30
1        2          34205.66     687.23         200.10          487.13
2        3          33718.53     687.23         197.25          489.98
3        4          33228.55     687.23         194.38          492.85
4        5          32735.70     687.23         191.50          495.73
..     ...               ...        ...            ...             ...
403     56           3951.11     796.01           9.54          786.47
404     57           3164.64     796.01           7.64          788.37
405     58           2376.27     796.01           5.74          790.27
406     59           1586.00     796.01           3.83          792.18
407     60            793.82     796.01           1.91          794.10

     New Balance  term  interest_rate       car_type
0       34205.66    60         0.0702  Toyota Sienna
1       33718.53    60         0.0702  Toyota Sienna
2       33228.55    60         0.0702  Toyota Sienna
3       32735.70    60         0.0702  Toyota Sienna
4       32239.97    60         0.0702  Toyota Sienna
..           ...   ...            ...            ...
403      3164.64    60         0.0290      VW Golf R
404      2376.27    60         0.0290      VW Golf R
405      1586.00    60         0.0290      VW Golf R
406       793.82    60         0.0290      VW Golf R
407        -0.28    60         0.0290      VW Golf R

[408 rows x 9 columns]>

In [15]:
df.columns

Index(['Month', 'Starting Balance', 'Repayment', 'Interest Paid',
       'Principal Paid', 'New Balance', 'term', 'interest_rate', 'car_type'],
      dtype='object')

In [17]:
df[['Month', 'Starting Balance']][0:5]

   Month  Starting Balance
0      1          34689.96
1      2          34205.66
2      3          33718.53
3      4          33228.55
4      5          32735.70

In [ ]:
#save into excel
wanted = df[['Interest Paid','Principal Paid', 'New Balance']]
stored = wanted.to_excel("new_excel", index = None)

In [19]:
print(df.loc[df['car_type'] == 'Toyota Sienna'])

     Month  Starting Balance  Repayment  Interest Paid  Principal Paid  \
0        1          34689.96     687.23         202.93          484.30
1        2          34205.66     687.23         200.10          487.13
2        3          33718.53     687.23         197.25          489.98
3        4          33228.55     687.23         194.38          492.85
4        5          32735.70     687.23         191.50          495.73
..     ...               ...        ...            ...             ...
115     56           3133.83     632.47           9.37          623.10
116     57           2510.73     632.47           7.51          624.96
117     58           1885.77     632.47           5.64          626.83
118     59           1258.94     632.47           3.76          628.71
119     60            630.23     632.47           1.88          630.59

     New Balance  term  interest_rate       car_type
0       34205.66    60         0.0702  Toyota Sienna
1       33718.53    60         0.0702  Toyota Sienna
2       33228.55    60         0.0702  Toyota Sienna
3       32735.70    60         0.0702  Toyota Sienna
4       32239.97    60         0.0702  Toyota Sienna
..           ...   ...            ...            ...
115      2510.73    60         0.0359  Toyota Sienna
116      1885.77    60         0.0359  Toyota Sienna
117      1258.94    60         0.0359  Toyota Sienna
118       630.23    60         0.0359  Toyota Sienna
119        -0.36    60         0.0359  Toyota Sienna

[120 rows x 9 columns]

In [28]:
df.dtypes

Month                 int64
Starting Balance    float64
Repayment           float64
Interest Paid       float64
Principal Paid      float64
New Balance         float64
term                  int64
interest_rate       float64
car_type             object
dtype: object

In [30]:
df["tax%"] = df["Starting Balance"].apply (lambda x: .15 if 1 < x < 2000 else .25 if 2000 < x <30000 else .30)

In [31]:
print(df)

     Month  Starting Balance  Repayment  Interest Paid  Principal Paid  \
0        1          34689.96     687.23         202.93          484.30
1        2          34205.66     687.23         200.10          487.13
2        3          33718.53     687.23         197.25          489.98
3        4          33228.55     687.23         194.38          492.85
4        5          32735.70     687.23         191.50          495.73
..     ...               ...        ...            ...             ...
403     56           3951.11     796.01           9.54          786.47
404     57           3164.64     796.01           7.64          788.37
405     58           2376.27     796.01           5.74          790.27
406     59           1586.00     796.01           3.83          792.18
407     60            793.82     796.01           1.91          794.10

     New Balance  term  interest_rate       car_type  tax%
0       34205.66    60         0.0702  Toyota Sienna  0.30
1       33718.53    60         0.0702  Toyota Sienna  0.30
2       33228.55    60         0.0702  Toyota Sienna  0.30
3       32735.70    60         0.0702  Toyota Sienna  0.30
4       32239.97    60         0.0702  Toyota Sienna  0.30
..           ...   ...            ...            ...   ...
403      3164.64    60         0.0290      VW Golf R  0.25
404      2376.27    60         0.0290      VW Golf R  0.25
405      1586.00    60         0.0290      VW Golf R  0.25
406       793.82    60         0.0290      VW Golf R  0.15
407        -0.28    60         0.0290      VW Golf R  0.15

[408 rows x 10 columns]

In [34]:
to_drop = ['Repayment', 'term']
df.drop(columns = to_drop, inplace = True)

In [35]:
df.head(5)

,Month,Starting Balance,Interest Paid,Principal Paid,New Balance,interest_rate,car_type,tax%
0,1,34689.96,202.93,484.30,34205.66,0.0702,Toyota Sienna,0.3
1,2,34205.66,200.10,487.13,33718.53,0.0702,Toyota Sienna,0.3
2,3,33718.53,197.25,489.98,33228.55,0.0702,Toyota Sienna,0.3
3,4,33228.55,194.38,492.85,32735.70,0.0702,Toyota Sienna,0.3
4,5,32735.70,191.50,495.73,32239.97,0.0702,Toyota Sienna,0.3

In [36]:
df["test_col"] = False
df.loc[df['New Balance'] > 20000, 'test_col'] = True
print(df)

     Month  Starting Balance  Interest Paid  Principal Paid  New Balance  \
0        1          34689.96         202.93          484.30     34205.66
1        2          34205.66         200.10          487.13     33718.53
2        3          33718.53         197.25          489.98     33228.55
3        4          33228.55         194.38          492.85     32735.70
4        5          32735.70         191.50          495.73     32239.97
..     ...               ...            ...             ...          ...
403     56           3951.11           9.54          786.47      3164.64
404     57           3164.64           7.64          788.37      2376.27
405     58           2376.27           5.74          790.27      1586.00
406     59           1586.00           3.83          792.18       793.82
407     60            793.82           1.91          794.10        -0.28

     interest_rate       car_type  tax%  test_col
0           0.0702  Toyota Sienna  0.30      True
1           0.0702  Toyota Sienna  0.30      True
2           0.0702  Toyota Sienna  0.30      True
3           0.0702  Toyota Sienna  0.30      True
4           0.0702  Toyota Sienna  0.30      True
..             ...            ...   ...       ...
403         0.0290      VW Golf R  0.25     False
404         0.0290      VW Golf R  0.25     False
405         0.0290      VW Golf R  0.25     False
406         0.0290      VW Golf R  0.15     False
407         0.0290      VW Golf R  0.15     False

[408 rows x 9 columns]

In [37]:
print (df.groupby(df["test_col"]).mean())

              Month  Starting Balance  Interest Paid  Principal Paid  \
test_col
False     34.261364      10646.414091      35.258935      613.008409
True      13.604167      30243.040139      95.648819      733.171736

           New Balance  interest_rate      tax%
test_col
False     10033.405682       0.039996  0.241667
True      29509.868403       0.038882  0.274306

In [38]:
df = df.set_index('Month')
print(df.loc[60])

       Starting Balance  Interest Paid  Principal Paid  New Balance  \
Month
60               682.91           3.99          683.24        -0.33
60               630.23           1.88          630.59        -0.36
60               395.41           1.28          395.54        -0.13
60               793.82           1.91          794.10        -0.28

       interest_rate        car_type  tax%  test_col
Month
60            0.0702   Toyota Sienna  0.15     False
60            0.0359   Toyota Sienna  0.15     False
60            0.0390  Toyota Carolla  0.15     False
60            0.0290       VW Golf R  0.15     False

In [39]:
print(df.loc[60, 'car_type'])

Month
60     Toyota Sienna
60     Toyota Sienna
60    Toyota Carolla
60         VW Golf R
Name: car_type, dtype: object

In [41]:
df["Company"]=df['car_type'].str.split(expand = True)[0]

In [42]:
print(df["Company"])

Month
1     Toyota
2     Toyota
3     Toyota
4     Toyota
5     Toyota
       ...
56        VW
57        VW
58        VW
59        VW
60        VW
Name: Company, Length: 408, dtype: object

In [43]:
df.isnull().any()

Starting Balance    False
Interest Paid        True
Principal Paid      False
New Balance         False
interest_rate       False
car_type            False
tax%                False
test_col            False
Company             False
dtype: bool

In [44]:
df = df.replace(np.nan,"N/A", regex = True)

In [45]:
df.head()

,Starting Balance,Interest Paid,Principal Paid,New Balance,interest_rate,car_type,tax%,test_col,Company
Month,,,,,,,,,
1,34689.96,202.93,484.30,34205.66,0.0702,Toyota Sienna,0.3,True,Toyota
2,34205.66,200.1,487.13,33718.53,0.0702,Toyota Sienna,0.3,True,Toyota
3,33718.53,197.25,489.98,33228.55,0.0702,Toyota Sienna,0.3,True,Toyota
4,33228.55,194.38,492.85,32735.70,0.0702,Toyota Sienna,0.3,True,Toyota
5,32735.70,191.5,495.73,32239.97,0.0702,Toyota Sienna,0.3,True,Toyota

In [46]:
from openpyxl import load_workbook

In [48]:
wb = Workbook()
ws = wb.active

In [49]:
ws1 = wb.create_sheet('Newsheet')
ws2 = wb.create_sheet("Another_sheet",0)

In [51]:
ws.title = "mysheet"
print (wb.sheetnames)

['Another_sheet', 'mysheet', 'Newsheet']

In [53]:
wb2 = load_workbook(r"C:\Users\v-trugan\OneDrive - Microsoft\Desktop\TruptiFolder2020\Ex_Files_Python_Data_Visualization\Exercise_Files\3 Pandas\data\car_financing.xlsx")
new_sheet = wb2.create_sheet('Newsheet')
active_sheet = wb2.active
cell = active_sheet ["A1"]
print(cell)

<Cell 'Sheet1'.A1>

In [54]:
print(cell.value)

Month